.doom.d/config.org
#+TITLE: Doom Emacs Config
#+AUTHOR: Mark Bojack
#+EMAIL: markbojack@outlook.com
#+DESCRIPTION: Personal config.org document for Doom Emacs (v2.0.9)
#+STARTUP: overview
#+PROPERTY: header-args :results silent

Alphabetize this later, also TOC?

* Background
Doom Emacs config.org file.  A work in progress, but continually maintained on an Arch-based system.
For optimal performance, use in conjunction with packages.el and init.el.

* Sources
- [[https://nullprogram.com/blog/2016/12/22/][Chris Wellons]]
- [[https://github.com/daviwil][David Wilson]]
- [[https://gitlab.com/dwt1][Derek Taylor]]
- [[https://github.com/zaiste/][Jakub Neander]]
- [[https://github.com/jwiegley/dot-emacs/][John Wiegley]]
- [[https://github.com/angrybacon/dotemacs][Mathieu Marques]]
- [[https://github.com/sachac][Sacha Chua]]

* Speed
According to [[https://nullprogram.com/blog/2016/12/22/][Chris Wellons]], the below makes this config run a little faster.

#+BEGIN_SRC emacs-lisp
;;; config.el -*- lexical-binding: t; -*-
#+END_SRC

A [[https://github.com/daviwil][David Wilson]] trick: "Make gc pauses faster by decreasing the threshold."
David's figure was modified in concordance with the config of [[https://github.com/angrybacon/dotemacs][Mathieu Marques]].

#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold (* 8 1024 1024))
#+END_SRC

* Mappings
Mostly from [[https://github.com/zaiste/][Jakub Neander]].

#+BEGIN_SRC emacs-lisp
(map! :desc "Create Sparse Tree" :ne "SPC / s" #'org-sparse-tree)
(map! :desc "Create Sparse Tree for Tags" :ne "SPC / t" #'org-tags-sparse-tree)
(map! :ne "M-/" #'comment-or-uncomment-region)
(map! :ne "SPC n r" #'deadgrep)
(map! :ne "SPC n b" #'org-brain-visualize)
(map! :ne "SPC n p" #'counsel-org-capture)
#+END_SRC

* Personal Information
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Mark Bojack"
      user-mail-address "markbojack.si@gmail.com")
#+END_SRC

* TODO


#+begin_src emacs-lisp
(setq doom-font (font-spec :family "RobotoMono Nerd Font" :size 10 :weight 'bold)
      ;doom-big-font (font-spec :family "RobotoMono Nerd Font" :size 14))
      doom-variable-pitch-font (font-spec :family "sans" :size 13)
      doom-theme 'doom-one
      display-line-numbers-type 'relative
      evil-split-window-below t
      evil-vsplit-window-right t
      ess-indent-offset 2
      auto-save-default t
      make-backup-files t
      confirm-kill-emacs nil)

#+end_src
